# Function

In [ ]:
'''
def func_name(argumnets):
    statements...
    return(optional)
'''

In [1]:
def wishing(): ## Defining the function
    print("Hello...")

In [3]:
wishing() ## Calling the function

Hello...

In [5]:
## Passing parameters - inputs to the function
## While passing parameters in function and calling also, give parameters values

In [14]:
def wish(name):   ## name is a parameter
    print("Hello", name, "have a good day!")

In [15]:
wish("Chandan")

Hello Chandan have a good day!

In [16]:
## Program to take number as input and print its square value

In [17]:
def sq(num):
    print(num*num)

In [18]:
sq(-23)

529

In [19]:
## Program to add, sub, multiply and divide two numbers

In [20]:
def math_op(num1, num2):
    print("Add", num1 + num2)
    print("Sub", num1 - num2)
    print("Multiply", num1 * num2)
    print("Divide", num1 / num2)

In [21]:
math_op(52, 12)

Add 64
Sub 40
Multiply 624
Divide 4.333333333333333

In [22]:
## Return Statment

In [23]:
def add(x, y):
    return x + y

In [24]:
add(1, 110)

111

In [25]:
## Program to check given number is odd or even
def isEven(num):
    if(num % 2 == 0):
        print("Even")
    else:
        print("Odd")

In [26]:
isEven(23)

Odd

In [28]:
isEven(111+1)

Even

In [36]:
## Returning multiple values
def msg(name):
    return "Hello", name

In [37]:
msg("Data")

('Hello', 'Data')

In [38]:
x, y = msg("data")
print(x, y)

Hello data

In [ ]:
'''
1. Positional Argument (Order wise)
2. Keyword Argument
3. Default Argument
4. Variable Length Argument
'''

In [40]:
## 2. Keyword argument 
## i.e. by parameter name 
## Order is not important

In [41]:
def wish(name, msg):
    print(name, msg)

In [43]:
wish(name = "CK", msg = 111)

CK 111

In [44]:
wish(msg = '1111')

TypeError: wish() missing 1 required positional argument: 'name'

In [45]:
wish(name = "CK", "Wassup") ## Both should be with keyword or no one

SyntaxError: positional argument follows keyword argument (<ipython-input-45-a5275756b04f>, line 1)

In [47]:
## 3. Default Argument
## default argument must be last argument

In [48]:
def wish1(name = 'Guest'):
    print("Hello", name, "have a good day")

In [50]:
wish1()

Hello Guest have a good day

In [52]:
wish1(" 'Talk with Data' ")

Hello  'Talk with Data'  have a good day

In [57]:
def msg1(name, age = 23, Job = "Data Scientist"):
    print(name, age, Job)

In [58]:
msg1("CK+1")

CK+1 23 Data Scientist

In [59]:
## 4. Variable length Argument
## Sometimes we can pass variable number of arguments
## Variable lengeth Argument should be the first argument of the function

In [60]:
def f1(*n):
    print(n)

In [61]:
f1("Hello", "Data Scientist", "Chandan Kumar", 1111)

('Hello', 'Data Scientist', 'Chandan Kumar', 1111)

In [64]:
## 5. Keyword Argument
def kw1(**kwarg):
    print(kwarg)

In [65]:
kw1(car = 'Tesla', Age = 35, Job = 'Data Scientist with 12yrs exp', name = "Chandan Kumar")

{'car': 'Tesla', 'Age': 35, 'Job': 'Data Scientist with 12yrs exp', 'name': 'Chandan Kumar'}

In [66]:
## Lambda function
add = lambda a, b : a + b

In [67]:
add(101, 10)

111

In [70]:
biggest = lambda a, b : a if a > b else b

In [71]:
biggest(111, 11)

111

In [72]:
biggest(111, 111)

111

# Modules - In Python

In [73]:
## Math Modules

In [74]:
import math

In [75]:
math.sqrt(15)

3.872983346207417

In [76]:
math.pi

3.141592653589793

In [77]:
## Program to find the area of circle for any given radius

In [83]:
def circleArea(r):
    return math.pi*math.pow(r, 2)

In [84]:
circleArea(5)

78.53981633974483

# Pandas

In [90]:
## Pandas most useful for Data Analysis and Pre-Processing (Exploaratory Data Analysis)
## Two Things are Important
## 1. Series - 1D array
## 2. DataFrame - 2D array


## EDA - If there is a data and you want to understand the history and its various areas about the data while exploring.
##     - Finding meaningful pattern

In [91]:
import pandas as pd

In [92]:
l = [1, 2, 3, -1, -2, 0]
l, type(l)

([1, 2, 3, -1, -2, 0], list)

In [94]:
s = pd.Series(l)
s, type(s)

(0    1
 1    2
 2    3
 3   -1
 4   -2
 5    0
 dtype: int64,
 pandas.core.series.Series)

In [95]:
d = pd.DataFrame(l)
d

   0
0  1
1  2
2  3
3 -1
4 -2
5  0

In [104]:
df = pd.read_excel("Example.xlsx")

In [105]:
df.head() ## First 5 rows

   Customer   Age      Sex  Groceries  Choco-bars  Type   Satisfied   Bulk
0          1    36    Male        180           3  White           4     3
1          2    45    Male        180           4   Milk           3     2
2          3    20  Female        220           3  White           2     3
3          4    27  Female        180           2  White           4     2
4          5    22  Female        220           5   Milk           3     2

In [107]:
df.tail() ## Last 5 rows

    Customer   Age      Sex  Groceries  Choco-bars  Type   Satisfied   Bulk
45         46    40  Female        250           3   Dark           3     4
46         47    37  Female        220           5  White           2     4
47         48    23    Male        150           5   Dark           4     3
48         49    36    Male        180           4  White           3     3
49         50    24    Male        180           2   Dark           4     3

In [108]:
df.head(15)

    Customer   Age      Sex  Groceries  Choco-bars  Type   Satisfied   Bulk
0           1    36    Male        180           3  White           4     3
1           2    45    Male        180           4   Milk           3     2
2           3    20  Female        220           3  White           2     3
3           4    27  Female        180           2  White           4     2
4           5    22  Female        220           5   Milk           3     2
5           6    39    Male        150           2   Dark           4     2
6           7    30    Male        220           5   Dark           2     4
7           8    42    Male        220           2   Milk           4     1
8           9    20  Female        250           3  White           4     4
9          10    40  Female        180           2   Milk           3     1
10         11    38  Female        180           2  White           2     3
11         12    31    Male        150           4   Dark           2     1
12         13    19    Male        220           2   Dark           2     3
13         14    23    Male        180           5   Dark           1     4
14         15    36  Female        200           2  White           4     1

In [109]:
df.tail(10)

    Customer   Age      Sex  Groceries  Choco-bars  Type   Satisfied   Bulk
40         41    23  Female        220           4   Dark           2     1
41         42    24    Male        150           2   Dark           2     1
42         43    29    Male        180           4  White           2     4
43         44    32    Male        150           4   Dark           2     1
44         45    26  Female        250           2  White           4     3
45         46    40  Female        250           3   Dark           3     4
46         47    37  Female        220           5  White           2     4
47         48    23    Male        150           5   Dark           4     3
48         49    36    Male        180           4  White           3     3
49         50    24    Male        180           2   Dark           4     3

In [111]:
df.shape

(50, 8)

In [112]:
data = df.copy() ## Make copy of data so original data dont get affected good for pre processing

In [119]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Customer    50 non-null     int64
 1   Age         50 non-null     int64
 2   Sex         50 non-null     object
 3   Groceries   50 non-null     int64
 4   Choco-bars  50 non-null     int64
 5   Type        50 non-null     object
 6   Satisfied   50 non-null     int64
 7   Bulk        50 non-null     int64
dtypes: int64(6), object(2)
memory usage: 3.2+ KB

In [117]:
data.describe()

       Customer        Age    Groceries  Choco-bars  Satisfied        Bulk
count   50.00000  50.000000   50.000000    50.00000   50.000000  50.000000
mean    25.50000  30.400000  196.200000     3.42000    2.720000   2.580000
std     14.57738   8.342172   34.040192     1.12649    1.050559   1.144463
min      1.00000  18.000000  150.000000     2.00000    1.000000   1.000000
25%     13.25000  23.000000  180.000000     2.00000    2.000000   1.250000
50%     25.50000  29.500000  200.000000     3.00000    3.000000   3.000000
75%     37.75000  37.750000  220.000000     4.00000    4.000000   3.750000
max     50.00000  45.000000  250.000000     5.00000    4.000000   4.000000